RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/***************************************************************************//**
* \file cy_sar2.h
* \version 1.0
*
* Provides an API declaration of the SAR2 driver
*
*******************************************************************************
* \copyright
* (c) (2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
*******************************************************************************
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/**
* \addtogroup group_sar2
* \{
* The SAR2 driver provides an API to configure the SAR2 ADC.
* The SAR2 has up to 4 ADCs and up to 32 channels for each ADC module. About
* actual number of supported modules and channels, refer to the technical
* reference manual (TRM) and device datasheet.
*
* \section group_sar2_configuration Configuration Considerations
* Typical usage:
*  - Call Cy_SAR2_Init to initialize the ADC module and its channels
*  - Call Cy_SAR2_Channel_SetInterruptMask if you need to use the interrupt.
* After initializing channel(s) call, trigger a call by the software
* (calling Cy_SAR2_Channel_SoftwareTrigger) or start a peripheral
* configured for the HW trigger.
*
\note It is not recommended to set the  triggerSelection structure member
* of the \ref cy_stc_sar2_channel_config_t to CY_SAR2_TRIGGER_CONTINUOUS if
* cy_en_sar2_preemption_type_t is set to CY_SAR2_PREEMPTION_ABORT_CANCEL.
* It may work to the effect that the channel or channel group will not be able
* to complete without advanced priority tuning.
* \par
*
* \note If you use an interrupt for ADC, create an interrupt handler
* and register it by using the sysint module. In the handler, you can check
* which interrupt is occurred by Cy_SAR2_Channel_GetInterruptStatusMasked
* and can get the conversion result by Cy_SAR2_Channel_GetResult.
* If you do not use the interrupt, you can poll the conversion status by
* Cy_SAR2_Channel_GetInterruptStatus.
* For both of polling and interrupt, clear the interrupt flags by
* Cy_SAR2_Channel_ClearInterrupt after handling data.
* \par
*
* \note SAR2 block can operate in Active or Sleep mode only.
*
* \subsection group_sar2_config Configuration Example
* First step would be to configure clock:
*
* \snippet sar2/snippet/main.c SNIPPET_CLOCK_INIT
*
* Group of two SAR2 ADC channels are configured, one for bandgap voltage
* and one for the AN0 analogue input:
*
* \snippet sar2/snippet/main.c SNIPPET_SAR2_CONFIG
*
* \subsection group_sar2_init Initialization
*
* \snippet sar2/snippet/main.c SNIPPET_SAR2_INIT
*
* \subsection group_sar2_result Obtaining results in counts
*
* \snippet sar2/snippet/main.c SNIPPET_SAR2_GET_RESULT
*
* \subsection group_sar2_calc_volts Calculating results in V, mV or uV
*
* \snippet sar2/snippet/main.c SNIPPET_SAR2_CALC_VOLTS
*
* \subsection group_sar2_die_temperature Die temperature
*
* \snippet sar2/snippet/main.c SNIPPET_SAR2_DIE_TEMPERATURE
*
* Once done, in the variable, returned by the
* \ref Cy_SAR2_CalculateDieTemperature function will contain the die temperature
* value in Celsius degrees.
*
* The accuracy can be increased by executing the calibration procedure
* (see \ref group_sar2_calibration section) before doing the conversion.
*
* In the function call, the first argument is the enumeration value,
* representing the VDDA value range supplied to this particular chip being used,
* see \ref cy_en_sar2_vdda_range_t.
*
* \subsection group_sar2_channel_grouping Channel grouping
* The SAR2 driver supports the channel grouping. Each channel can be either in
* an individual group or in a group of 2 or more channels. By default, the
* hardware will execute the next channel if it exists and is in the Enabled
* state if the current channel does not have the flag 'Group End' set. You can
* set triggers to start either the first channel or any channel of the group to
* execute all the next channels.
*
* \section group_sar2_more_information More Information
* Refer to the technical reference manual (TRM) and the device datasheet.
*
* \section group_sar2_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_sar2_macro Macros
* \{
*   \defgroup group_sar2_macros_interrupt        Interrupt Masks
*   \defgroup group_sar2_macros_status           Status Masks
* \}
* \defgroup group_sar2_functions Functions
* \defgroup group_sar2_data_structures Data structures
* \defgroup group_sar2_enums Enumerated Types
* \defgroup group_sar2_calibration Calibration procedure
*
* \n
* \addtogroup group_sar2_calibration
* \{
* To start the procedure, perform \ref group_sar2_config and
* \ref group_sar2_init with included extra channel, which can be re-used
* after this procedure is complete:
* \snippet sar2/snippet/main.c SNIPPET_CALIB_CH_INIT
* The ADC has an offset adjustment function to compensate for offset error.
* It is possible to select code from +127 to -128 in a dec. for analog
* calibration.
* \n
* The offset adjustment step is a quarter of 1LSb. \n
* Offset = max( 0, min( 4095, floor( VIN/VREFH x 4096 + OFST/4 ) ) )
* \image html sar2_offset_calibration.png
* \note Enable reference buffer mode using \ref Cy_SAR2_SetReferenceBufferMode
* function.
*
* \n
* Following code snippet can be used:
* \snippet sar2/snippet/main.c SNIPPET_SAR2_OFFSET_CALIBRATION
*
* After that, the Gain should also be calibrated as well.
* The ADC has a gain adjustment function to compensate for gain error.
* It is possible to set code from +15 to -15 dec.
* The gain adjustment step is a quarter of 1LSb. \n
* Gain = max(0, min(4095, floor((4096 - GAIN)/VREFH x (VIN - VREFH/2) + 2048)))
* \image html sar2_gain_calibration.png
* \snippet sar2/snippet/main.c SNIPPET_SAR2_GAIN_CALIBRATION
* \n
* Once done, the calibrationConfig global structure contains calibration data
* for SAR2 block 0. Calibration is advised to be done as frequent as possible.
* \}
*/


#if !defined(CY_SAR2_H)
#define CY_SAR2_H

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <math.h>
#include "cy_syslib.h"
#include "cy_utils.h"
#include "cy_device.h"

#if defined (CY_IP_MXS40EPASS_ESAR)

#if defined(__cplusplus)
extern "C" {
#endif

