RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/***************************************
*       Macro definitions
***************************************/

/**
* \addtogroup group_sar2_macro
* \{
*/

/** Driver major version */
#define CY_SAR2_DRV_VERSION_MAJOR  1

/** Driver minor version */
#define CY_SAR2_DRV_VERSION_MINOR  0

/** Sar2 driver ID */
#define CY_SAR2_ID                 CY_PDL_DRV_ID(0x4BUL)

/** Number of input triggers */
#define CY_SAR2_TR_IN_NUM          (5UL)

/** Number of output triggers */
#define CY_SAR2_TR_OUT_NUM         (2UL)

/** Maximum generic input trigger */
#define CY_SAR2_GEN_TR_IN_NUM      (16UL)

/** Maximum generic output trigger */
#define CY_SAR2_GEN_TR_OUT_NUM     (64UL)

/** Temperature matrix sixe */
#define CY_SAR2_TEMP_MATRIX_SIZE   (3UL)

/** Channel number */
#define CY_SAR2_NUM_CHANNELS       (32UL)

/***************************************
*       Group status
***************************************/
/** \addtogroup group_sar2_macros_status
* \{
*/
/** If this bit is true, "out of range" was detected and the value was above the High threshold. */
#define CY_SAR2_STATUS_ABOVE       (PASS_SAR_CH_RESULT_ABOVE_HI_MIR_Msk)

/** If this bit is true, the range is detected. */
#define CY_SAR2_STATUS_RANGE       (PASS_SAR_CH_RESULT_RANGE_INTR_MIR_Msk)

/** If this bit is true, the pulse is detected. */
#define CY_SAR2_STATUS_PULSE       (PASS_SAR_CH_RESULT_PULSE_INTR_MIR_Msk)

/** If this bit is true, the result data is valid. */
#define CY_SAR2_STATUS_VALID       (PASS_SAR_CH_RESULT_VALID_MIR_Msk)

/** Group acquisition completed. This bit can be set for the last channel of a group if the group scan is done. */
#define CY_SAR2_GRP_COMPLETE       (PASS_SAR_CH_GRP_STAT_GRP_COMPLETE_Msk)

/** Group Cancelled. This bit can be set for the last channel of a group if the group scan was
 *  preempted and cancelled. */
#define CY_SAR2_GRP_CANCELLED      (PASS_SAR_CH_GRP_STAT_GRP_CANCELLED_Msk)

/** Group Overflow. This bit can be set for the last channel of a group if the group scan is
 *  done and the Done interrupt is already (still) pending. */
#define CY_SAR2_GRP_OVERFLOW       (PASS_SAR_CH_GRP_STAT_GRP_OVERFLOW_Msk)

/** Channel Range completed. This bit can be set for each channel if the conversion result
 *  (after averaging) of that channel met the condition specified by the range detection
 *  mode settings of the channel. */
#define CY_SAR2_CH_RANGE_COMPLETE  (PASS_SAR_CH_GRP_STAT_CH_RANGE_COMPLETE_Msk)

/** Channel Pulse completed. This bit can be set for each channel if the positive pulse counter reaches zero. */
#define CY_SAR2_CH_PULSE_COMPLETE  (PASS_SAR_CH_GRP_STAT_CH_PULSE_COMPLETE_Msk)

/** Channel Overflow. This bit can be set for each channel if a new Pulse or Range interrupt is detected
 *  while the interrupt is still pending or when HW did not acknowledge data pickup.*/
#define CY_SAR2_CH_OVERFLOW        (PASS_SAR_CH_GRP_STAT_CH_OVERFLOW_Msk)

/** Group acquisition busy. */
#define CY_SAR2_GRP_BUSY           (PASS_SAR_CH_GRP_STAT_GRP_BUSY_Msk)

/** \} group_sar2_macros_status */


/***************************************
*       Interrupts
***************************************/
/** \addtogroup group_sar2_macros_interrupt
* \{
*/
/** Group done. */
#define CY_SAR2_INT_GRP_DONE                 (PASS_SAR_CH_INTR_GRP_DONE_Msk)

/** Group cancelled. */
#define CY_SAR2_INT_GRP_CANCELLED            (PASS_SAR_CH_INTR_GRP_CANCELLED_Msk)

/** Group overflow. */
#define CY_SAR2_INT_GRP_OVERFLOW             (PASS_SAR_CH_INTR_GRP_OVERFLOW_Msk)

/** Channel range event. */
#define CY_SAR2_INT_CH_RANGE                 (PASS_SAR_CH_INTR_CH_RANGE_Msk)

/** Channel pulse event. */
#define CY_SAR2_INT_CH_PULSE                 (PASS_SAR_CH_INTR_CH_PULSE_Msk)

/** Channel overflow event. */
#define CY_SAR2_INT_CH_OVERFLOW              (PASS_SAR_CH_INTR_CH_OVERFLOW_Msk)

/** Combined interrupt mask. */
#define CY_SAR2_INTR                     (CY_SAR2_INT_GRP_DONE | \
                                         CY_SAR2_INT_GRP_CANCELLED | \
                                         CY_SAR2_INT_GRP_OVERFLOW | \
                                         CY_SAR2_INT_CH_RANGE | \
                                         CY_SAR2_INT_CH_PULSE | \
                                         CY_SAR2_INT_CH_OVERFLOW)

/** \} group_sar2_macros_interrupt */

/** \cond INTERNAL */
/** Macro that returns the channel number for a specified SAR instance. */
#define CY_SAR2_CHAN_NUM(base)               ((PASS0_SAR0 == (base)) ? PASS_SAR_SLICE_NR0_SAR_SAR_MUX_IN :\
                                              (PASS0_SAR1 == (base)) ? PASS_SAR_SLICE_NR1_SAR_SAR_MUX_IN :\
                                                                       PASS_SAR_SLICE_NR2_SAR_SAR_MUX_IN)

#define CY_SAR2_CHAN_NUM_VALID(base, channel) (CY_SAR2_CHAN_NUM(base) > (channel))

/** \endcond */

/** \} group_sar2_macro */

/***************************************
*       Enumeration
***************************************/

/**
* \addtogroup group_sar2_enums
* \{
*/

/**
* SAR2 Driver error codes
*/
typedef enum {
    CY_SAR2_SUCCESS   = 0x00U,                                    /**< Returned successful */
    CY_SAR2_BAD_PARAM = CY_SAR2_ID | CY_PDL_STATUS_ERROR | 0x01U, /**< A bad parameter was passed */
} cy_en_sar2_status_t;

/** When set uses 2 cycles for the Most Significant Bit (MSB). */
typedef enum {
    CY_SAR2_MSB_STRETCH_MODE_1CYCLE = 0U, /**< Use 1 clock cycles per conversion. */
    CY_SAR2_MSB_STRETCH_MODE_2CYCLE = 1U  /**< Use 2 clock cycles per conversion. */
} cy_en_sar2_msb_stretch_mode_t;

/** The Diagnostic Reference function selection. */
typedef enum {
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFL       = 0U,  /**< DiagOut = VrefL */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_1DIV8 = 1U,  /**< DiagOut = VrefH * 1/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_2DIV8 = 2U,  /**< DiagOut = VrefH * 2/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_3DIV8 = 3U,  /**< DiagOut = VrefH * 3/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_4DIV8 = 4U,  /**< DiagOut = VrefH * 4/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_5DIV8 = 5U,  /**< DiagOut = VrefH * 5/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_6DIV8 = 6U,  /**< DiagOut = VrefH * 6/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH_7DIV8 = 7U,  /**< DiagOut = VrefH * 7/8 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFH       = 8U,  /**< DiagOut = VrefH */
    CY_SAR2_DIAG_REFERENCE_SELECT_VREFX       = 9U,  /**< DiagOut = VrefX = VrefH * 199/200 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VBG         = 10U, /**< DiagOut = Vbg from SRSS */
    CY_SAR2_DIAG_REFERENCE_SELECT_VIN1        = 11U, /**< DiagOut = Vin1 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VIN2        = 12U, /**< DiagOut = Vin2 */
    CY_SAR2_DIAG_REFERENCE_SELECT_VIN3        = 13U, /**< DiagOut = Vin3 */
    CY_SAR2_DIAG_REFERENCE_SELECT_I_SOURCE    = 14U, /**< DiagOut = Isource (10uA) */
    CY_SAR2_DIAG_REFERENCE_SELECT_I_SINK      = 15U  /**< DiagOut = Isink (10uA) */
} cy_en_sar2_diag_reference_select_t;

/** The SAR2 trigger mode selection. */
typedef enum {
    CY_SAR2_TRIGGER_OFF        = 0U, /**< Use for channels in group, except the first channel */
    CY_SAR2_TRIGGER_TCPWM      = 1U, /**< Trigger from corresponding TCPWM channel */
    CY_SAR2_TRIGGER_GENERIC0   = 2U, /**< Generic trigger input 0 */
    CY_SAR2_TRIGGER_GENERIC1   = 3U, /**< Generic trigger input 1 */
    CY_SAR2_TRIGGER_GENERIC2   = 4U, /**< Generic trigger input 2 */
    CY_SAR2_TRIGGER_GENERIC3   = 5U, /**< Generic trigger input 3 */
    CY_SAR2_TRIGGER_GENERIC4   = 6U, /**< Generic trigger input 4 */
    CY_SAR2_TRIGGER_CONTINUOUS = 7U  /**< Always triggered (also called idle), can only be used for at most 1 channel */
} cy_en_sar2_trigger_selection_t;

/** The SAR2 ADC preemption type selection. */
typedef enum {
    CY_SAR2_PREEMPTION_ABORT_CANCEL  = 0U, /**< Abort the ongoing acquisition, does not return. */
    CY_SAR2_PREEMPTION_ABORT_RESTART = 1U, /**< Abort ongoing acquisition, up on return Restart
                                               group from the first channel. */
    CY_SAR2_PREEMPTION_ABORT_RESUME  = 2U, /**< Abort the ongoing acquisition, up on return Resume group from
                                               the aborted channel. */
    CY_SAR2_PREEMPTION_FINISH_RESUME = 3U  /**< Completed ongoing acquisition (including averaging), up on return
                                               Resume group from the next channel. */
} cy_en_sar2_preemption_type_t;

