RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/** Conversion done, trigger output selection. */
typedef enum {
    CY_SAR2_DONE_LEVEL_PULSE = 0U,   /**< The conversion done signal for other IPs is a 2-cycle pulse (clk_sys), no need
                                         to read the result register. Typically used for triggering another IPs other
                                         than DW. */
    CY_SAR2_DONE_LEVEL_LEVEL = 1U    /**< The conversion done signal for other IPs is the level output until the result
                                         register is read. Typically used for DW and also overflowed? detection. */
} cy_en_sar2_done_level_t;

/** The address of the analog signal (pin) to be sampled by a corresponding channel. */
typedef enum {
    CY_SAR2_PIN_ADDRESS_AN0       = 0U,  /**<  Vout = AN0, select the corresponding analog input. */
    CY_SAR2_PIN_ADDRESS_AN1       = 1U,
    CY_SAR2_PIN_ADDRESS_AN2       = 2U,
    CY_SAR2_PIN_ADDRESS_AN3       = 3U,
    CY_SAR2_PIN_ADDRESS_AN4       = 4U,
    CY_SAR2_PIN_ADDRESS_AN5       = 5U,
    CY_SAR2_PIN_ADDRESS_AN6       = 6U,
    CY_SAR2_PIN_ADDRESS_AN7       = 7U,
    CY_SAR2_PIN_ADDRESS_AN8       = 8U,
    CY_SAR2_PIN_ADDRESS_AN9       = 9U,
    CY_SAR2_PIN_ADDRESS_AN10      = 10U,
    CY_SAR2_PIN_ADDRESS_AN11      = 11U,
    CY_SAR2_PIN_ADDRESS_AN12      = 12U,
    CY_SAR2_PIN_ADDRESS_AN13      = 13U,
    CY_SAR2_PIN_ADDRESS_AN14      = 14U,
    CY_SAR2_PIN_ADDRESS_AN15      = 15U,
    CY_SAR2_PIN_ADDRESS_AN16      = 16U,
    CY_SAR2_PIN_ADDRESS_AN17      = 17U,
    CY_SAR2_PIN_ADDRESS_AN18      = 18U,
    CY_SAR2_PIN_ADDRESS_AN19      = 19U,
    CY_SAR2_PIN_ADDRESS_AN20      = 20U,
    CY_SAR2_PIN_ADDRESS_AN21      = 21U,
    CY_SAR2_PIN_ADDRESS_AN22      = 22U,
    CY_SAR2_PIN_ADDRESS_AN23      = 23U,
    CY_SAR2_PIN_ADDRESS_AN24      = 24U,
    CY_SAR2_PIN_ADDRESS_AN25      = 25U,
    CY_SAR2_PIN_ADDRESS_AN26      = 26U,
    CY_SAR2_PIN_ADDRESS_AN27      = 27U,
    CY_SAR2_PIN_ADDRESS_AN28      = 28U,
    CY_SAR2_PIN_ADDRESS_AN29      = 29U,
    CY_SAR2_PIN_ADDRESS_AN30      = 30U,
    CY_SAR2_PIN_ADDRESS_AN31      = 31U,
    CY_SAR2_PIN_ADDRESS_VMOTOR    = 32U, /**< Vout = Vmotor, select the motor input. */
    CY_SAR2_PIN_ADDRESS_VAUX      = 33U, /**< Vout = Vaux, select the auxiliarly input. */
    CY_SAR2_PIN_ADDRESS_AMUXBUS_A = 34U, /**< Vout = AmuxbusA. */
    CY_SAR2_PIN_ADDRESS_AMUXBUS_B = 35U, /**< Vout = AmuxbusB. */
    CY_SAR2_PIN_ADDRESS_VCCD      = 36U, /**< Vout = Vccd. */
    CY_SAR2_PIN_ADDRESS_VDDA      = 37U, /**< Vout = Vdda. */
    CY_SAR2_PIN_ADDRESS_VBG       = 38U, /**< Vout = Vbg, Bandgap voltage from SRSS. */
    CY_SAR2_PIN_ADDRESS_VTEMP     = 39U, /**< Vout = Vtemp, select the temperature sensor.
                                             Ensure that only 1 ADC is allowed to use this. */
    CY_SAR2_PIN_ADDRESS_VREF_L    = 62U, /**< Vout = VrefL (VrefL actually bypasses the SARMUX (XSL)). */
    CY_SAR2_PIN_ADDRESS_VREF_H    = 63U  /**< Vout = VrefH  (VrefH actually bypasses the SARMUX (XSH)) */
} cy_en_sar2_pin_address_t;

/** The physical port. This field is only valid for the SAR2 ADC0 block. */
typedef enum {
    CY_SAR2_PORT_ADDRESS_SARMUX0 = 0U, /**< ADC uses its own SARMUX. */
    CY_SAR2_PORT_ADDRESS_SARMUX1 = 1U, /**< ADC0 uses SARMUX1 (only valid for ADC0,
                                           undefined result if used for ADC1-3). */
    CY_SAR2_PORT_ADDRESS_SARMUX2 = 2U, /**< ADC0 uses SARMUX2 (only valid for ADC0,
                                           undefined result if used for ADC1-3). */
    CY_SAR2_PORT_ADDRESS_SARMUX3 = 3U  /**< ADC0 uses SARMUX3 (only valid for ADC0,
                                           undefined result if used for ADC1-3). */
} cy_en_sar2_port_address_t;

/** Preconditioning mode selection.
    Preconditioning charges or discharges the SAR sample capacitor to the selected reference voltage for precondition
    time (global) cycles, a break before a make cycle will be inserted before sampling starts the sample time.
    See also \ref cy_stc_sar2_config_t */
typedef enum {
    CY_SAR2_PRECONDITION_MODE_OFF    = 0U,   /**< No preconditioning. */
    CY_SAR2_PRECONDITION_MODE_VREFL  = 1U,   /**< Discharge to VREFL. */
    CY_SAR2_PRECONDITION_MODE_VREFH  = 2U,   /**< Charge to VREFH. */
    CY_SAR2_PRECONDITION_MODE_DIAG   = 3U    /**< Connect the Diagnostic reference output during preconditioning.
                                                 Configure the Diagnostic reference to output
                                                 the reference voltage. */
} cy_en_sar2_precondition_mode_t;

/** Overlap mode or SARMUX Diagnostics selection, in both cases only used when the Diagnostic reference is used. */
typedef enum {
    CY_SAR2_OVERLAP_DIAG_MODE_OFF        = 0U,   /**< No overlap or SARMUX Diagnostics. */
    CY_SAR2_OVERLAP_DIAG_MODE_HALF       = 1U,   /**< Sample the selected analog input for 2 sample time periods.
                                                     During the first period, use the overlap sampling,
                                                     i.e. connect both the analog input and Diagnostic reference.
                                                     During the second period only connect the analog input */
    CY_SAR2_OVERLAP_DIAG_MODE_FULL       = 2U,   /**< The selected analog input for a single sample
                                                     time period is like a normal sample but use the overlap sampling,
                                                     i.e. connect both the analog input and Diagnostic reference. */
    CY_SAR2_OVERLAP_DIAG_MODE_MUX_DIAG   = 3U    /**< Select Diagnostic reference instead of analog signal at the
                                                     input of the SARMUX. This enables a functional safety check
                                                     of the SARMUX analog connections. */
} cy_en_sar2_overlap_diag_mode_t;

/** Calibration values selection. */
typedef enum {
    CY_SAR2_CALIBRATION_VALUE_REGULAR    = 0U,   /**< Use regular calibration values */
    CY_SAR2_CALIBRATION_VALUE_ALTERNATE  = 1U    /**< Use alternate calibration values */
} cy_en_sar2_calibration_value_select_t;


/** Post processing mode selection. */
typedef enum {
    CY_SAR2_POST_PROCESSING_MODE_NONE        = 0U,  /**< No post processing. */
    CY_SAR2_POST_PROCESSING_MODE_AVG         = 1U,  /**< Averaging. */
    CY_SAR2_POST_PROCESSING_MODE_AVG_RANGE   = 2U,  /**< Averaging followed by Range detect. */
    CY_SAR2_POST_PROCESSING_MODE_RANGE       = 3U,  /**< Range detect. */
    CY_SAR2_POST_PROCESSING_MODE_RANGE_PULSE = 4U,  /**< Range detect followed by pulse detect. */
} cy_en_sar2_post_processing_mode_t;

/** Result data alignment selection. */
typedef enum {
    CY_SAR2_RESULT_ALIGNMENT_RIGHT           = 0U, /**< The data is right aligned in result[11:0], with sign extension
                                                       to 16 bits if enabled. */
    CY_SAR2_RESULT_ALIGNMENT_LEFT            = 1U, /**< The data shifts left in result[15:4] with the
                                                       lower nibble 0. Caveat if the result is more than 12 bits
                                                       (e.g. after averaging), then the bits above 12 will be
                                                       discarded. */

} cy_en_sar2_result_alignment_t;

