RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/** Select whether result data is signed or unsigned. */
typedef enum {
    CY_SAR2_SIGN_EXTENTION_UNSIGNED          = 0U, /**< Result data is unsigned (zero-extended if needed). */
    CY_SAR2_SIGN_EXTENTION_SIGNED            = 1U, /**< Result data is signed (sign-extended if needed). */
} cy_en_sar2_sign_extention_t;

/** Range detection mode selection. */
typedef enum {
    CY_SAR2_RANGE_DETECTION_MODE_BELOW_LO        = 0U,   /**< Below Low threshold (result < Lo) */
    CY_SAR2_RANGE_DETECTION_MODE_INSIDE_RANGE    = 1U,   /**< Inside range (Lo <= result < Hi) */
    CY_SAR2_RANGE_DETECTION_MODE_ABOVE_HI        = 2U,   /**< Above high threshold (Hi <= result) */
    CY_SAR2_RANGE_DETECTION_MODE_OUTSIDE_RANGE   = 3U    /**< Outside range (result < Lo || Hi <= result) */
} cy_en_sar2_range_detection_mode_t;

/** Reference buffer mode selection. */
typedef enum {
    CY_SAR2_REF_BUF_MODE_OFF     = 0U,   /**< No reference mode selected */
    CY_SAR2_REF_BUF_MODE_ON      = 1U,   /**< Reference buffered Vbg from SRSS */
    CY_SAR2_REF_BUF_MODE_BYPASS  = 3U,   /**< Reference unbuffered Vbg from SRSS */
} cy_en_sar2_ref_buf_mode_t;

/** VDDA voltage range selection. */
typedef enum {
    CY_SAR2_VDDA_2_7V_TO_4_5V     = 0U,   /**< The Vdda is in range from 2.7 to 4.5 V */
    CY_SAR2_VDDA_4_5V_TO_5_5V     = 1U,   /**< The Vdda is in range from 4.5 to 5.5 V */
} cy_en_sar2_vdda_range_t;

/** \} group_sar2_enums */

/***************************************
*       Configuration Structure
***************************************/
/**
* \addtogroup group_sar2_data_structures
* \{
*/

/** Configuration structure of the SAR2 ADC channel */
typedef struct {
    bool                                channelHwEnable;    /**< If HW is started, or just configured. */
    cy_en_sar2_trigger_selection_t      triggerSelection;   /**< The ADC trigger mode selection,
                                                                see \ref cy_en_sar2_trigger_selection_t */
    uint8_t                             channelPriority;    /**< Channel priority. 0=highest, 7=lowest.*/
    cy_en_sar2_preemption_type_t        preenptionType;     /**< The ADC preemption type selection,
                                                                see \ref cy_en_sar2_preemption_type_t */
    bool                                isGroupEnd;         /**< This value indicates that this channel is the last
                                                                channel of a group or not */
    cy_en_sar2_done_level_t             doneLevel;          /**< Conversion done, trigger output selection,
                                                                see \ref cy_en_sar2_done_level_t */
    cy_en_sar2_pin_address_t            pinAddress;         /**< The address of the analog signal (pin) to be sampled by
                                                                a corresponding channel,
                                                                see \ref cy_en_sar2_pin_address_t */
    cy_en_sar2_port_address_t           portAddress;        /**< Select the physical port,
                                                                see \ref cy_en_sar2_port_address_t */
    uint8_t                             extMuxSelect;       /**< External analog mux selection. */
    bool                                extMuxEnable;       /**< External analog mux enable. */
    cy_en_sar2_precondition_mode_t      preconditionMode;   /**< Select Preconditioning mode,
                                                                see \ref cy_en_sar2_precondition_mode_t */
    cy_en_sar2_overlap_diag_mode_t      overlapDiagMode;    /**< Select Overlap mode or SARMUX Diagnostics,
                                                                see \ref cy_en_sar2_overlap_diag_mode_t */
    uint16_t                            sampleTime;         /**< Sample time (aperture) in ADC clock cycles.
                                                                The minimum is 1 (0 gives the same result as 1),
                                                                the minimum time needed for the proper settling is at
                                                                least 300ns, i.e. 6 clock cycles at the max frequency of
                                                                20MHz. */
    cy_en_sar2_calibration_value_select_t calibrationValueSelect;    /**< Select calibration values, see
                                                                         \ref cy_en_sar2_calibration_value_select_t */
    cy_en_sar2_result_alignment_t         resultAlignment;    /**< Select the result data alignment,
                                                                  see \ref cy_en_sar2_result_alignment_t */
    cy_en_sar2_sign_extention_t           signExtention;      /**< Select whether the result data is signed or unsigned,
                                                                  see \ref cy_en_sar2_sign_extention_t */
    cy_en_sar2_post_processing_mode_t     postProcessingMode; /**< Select Post processing mode == ,
                                                                  see \ref cy_en_sar2_post_processing_mode_t */
    uint16_t                              averageCount;       /**< Averaging count. Active only if post processing mode
                                                                  is set to Averaging or Averaging + Range detect.
                                                                  The valid range is [1..256] */
    uint8_t                               rightShift;         /**< Shift Right. When using post processing mode with
                                                                  averaging, the set value is used for the right-shift
                                                                  value of the conversion result. Averaging data may be
                                                                  over 12 bits, therefore the user must ensure the
                                                                  conversion result is not to over 12 bits by using
                                                                  this value. This value is also used to fit the 12-bit
                                                                  result in 8 bits. The valid range is [0..15]*/
    uint16_t                              positiveReload;      /**< Positive pulse reload value. Active only if
                                                                   post processing is set to the Pulse detection.
                                                                   The valid range is [0..255]. */
    uint8_t                               negativeReload;      /**< Negative pulse reload value. Active only if
                                                                   post processing is set to the Pulse detection.
                                                                   The valid range is [0..31]. */
    cy_en_sar2_range_detection_mode_t     rangeDetectionMode; /**< Select Range detection mode,
                                                                  see \ref cy_en_sar2_range_detection_mode_t */
    uint16_t                      rangeDetectionLoThreshold;  /**< Range detect low threshold (Lo) */
    uint16_t                      rangeDetectionHiThreshold;  /**< Range detect high threshold (Hi) */
    uint32_t                      interruptMask;              /**< Select the interrupt sources.
                                                                  See \ref group_sar2_macros_interrupt */

} cy_stc_sar2_channel_config_t;

/** Configuration structure of the SAR2 HW block */
typedef struct {
    uint8_t                       preconditionTime;    /**< The number of ADC clock cycles when Preconditioning is done
                                                           before the sample window starts. */
    uint8_t                       powerupTime;         /**< The number of cycles to wait for power up after
                                                           IDLE_PWRDWN. */
    bool                          enableIdlePowerDown; /**< When idle automatically power is down, the analog if
                                                            true. */
    cy_en_sar2_msb_stretch_mode_t msbStretchMode;      /**< When the set uses 2 cycles for the Most Significant Bit
                                                           (MSB), see \ref cy_en_sar2_msb_stretch_mode_t */
    bool                          enableHalfLsbConv;   /**< When true takes an extra cycle to convert the half LSB and
                                                           add it to the 12-bit result for Missing Code Recovery */
    bool                          sarMuxEnable;        /**< Enable the SARMUX (only valid if sarIpEnable = true). */
    bool                          adcEnable;           /**< Enable the SAR ADC and SAR sequencer
                                                           (only valid if sarIpEnable = true). */
    bool                          sarIpEnable;         /**< Enable the SAR IP. */
    cy_stc_sar2_channel_config_t * channelConfig[CY_SAR2_NUM_CHANNELS];  /**< Channel configuration pointer array. */
} cy_stc_sar2_config_t;

/** Digital calibration values. */
typedef struct {
    uint16_t    offset; /**< Digital offset correction. The valid range is [0..4095] */
    int8_t     gain;   /**< Digital gain correction. The valid range is [-32..31] */
} cy_stc_sar2_digital_calibration_config_t;

/** Analog calibration values. */
typedef struct {
    int8_t     offset; /**< Analog offset correction. The valid range is [-128..127] */
    int8_t     gain;   /**< Analog gain correction. The valid range is [-16..15] */
} cy_stc_sar2_analog_calibration_conifg_t;

