RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/** Configuration structure of diagnosis function. */
typedef struct {
    cy_en_sar2_diag_reference_select_t   referenceSelect;    /**< Select Diagnostic Reference function,
                                                                 see \ref cy_en_sar2_diag_reference_select_t */
} cy_stc_sar2_diag_config_t;

/** Control freeze feature for debugging. */
typedef struct {
    bool      enableFreezeAdc0; /**< If true, freeze ADC0 in Debug mode. */
    bool      enableFreezeAdc1; /**< If true, freeze ADC1 in Debug mode. */
    bool      enableFreezeAdc2; /**< If true, freeze ADC2 in Debug mode. */
    bool      enableFreezeAdc3; /**< If true, freeze ADC3 in Debug mode. */
} cy_stc_sar2_debug_freeze_config_t;

/** \} group_sar2_data_structures */

/***************************************
*       Function Prototypes
***************************************/
/**
* \addtogroup group_sar2_functions
* \{
*/

/* For each ADC */
cy_en_sar2_status_t Cy_SAR2_Init(PASS_SAR_Type * base, const cy_stc_sar2_config_t * config);
__STATIC_INLINE void Cy_SAR2_DeInit(PASS_SAR_Type * base);
__STATIC_INLINE void Cy_SAR2_Enable(PASS_SAR_Type * base);
__STATIC_INLINE void Cy_SAR2_Disable(PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetPendingStatus(const PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkValidStatus(const PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkRangeStatus(const PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkRangeHiStatus(const PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkPulseStatus(const PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetResultValidStatus(const PASS_SAR_Type * base);
__STATIC_INLINE uint32_t Cy_SAR2_GetResultRangeHiStatus(const PASS_SAR_Type * base);

/* For each channel */
cy_en_sar2_status_t Cy_SAR2_Channel_Init(PASS_SAR_Type * base, uint32_t channel,
                                                                    const cy_stc_sar2_channel_config_t * channelConfig);
void Cy_SAR2_Channel_DeInit(PASS_SAR_Type * base, uint32_t channel);
uint16_t Cy_SAR2_Channel_GetResult(PASS_SAR_Type * base, uint32_t channel, uint32_t * status);
uint16_t Cy_SAR2_Channel_GetWorkingData(PASS_SAR_Type * base, uint32_t channel, uint32_t * status);
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetGroupStatus(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE void Cy_SAR2_Channel_Enable(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE void Cy_SAR2_Channel_Disable(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE void Cy_SAR2_Channel_SoftwareTrigger(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE void Cy_SAR2_Channel_SetInterruptMask(PASS_SAR_Type * base, uint32_t channel, uint32_t intrMask);
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetInterruptMask(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE void Cy_SAR2_Channel_ClearInterrupt(PASS_SAR_Type * base, uint32_t channel, uint32_t intrMask);
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetInterruptStatus(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetInterruptStatusMasked(PASS_SAR_Type * base, uint32_t channel);
__STATIC_INLINE void Cy_SAR2_Channel_SetInterrupt(PASS_SAR_Type * base, uint32_t channel, uint32_t intrMask);

/* For diagnosis function */
cy_en_sar2_status_t Cy_SAR2_Diag_Init(PASS_SAR_Type * base, const cy_stc_sar2_diag_config_t * diagConfig);
__STATIC_INLINE void Cy_SAR2_Diag_Enable(PASS_SAR_Type * base);
__STATIC_INLINE void Cy_SAR2_Diag_Disable(PASS_SAR_Type * base);

/* For calibration */
__STATIC_INLINE void Cy_SAR2_TriggerCalibrationUpdate(PASS_SAR_Type * base);
__STATIC_INLINE bool Cy_SAR2_IsCalibrationUpdateDone(PASS_SAR_Type * base);
cy_en_sar2_status_t Cy_SAR2_SetDigitalCalibrationValue(PASS_SAR_Type * base,
                                                       const cy_stc_sar2_digital_calibration_config_t * digCalibConfig);
cy_en_sar2_status_t Cy_SAR2_GetDigitalCalibrationValue(PASS_SAR_Type * base,
                                                             cy_stc_sar2_digital_calibration_config_t * digCalibConfig);
cy_en_sar2_status_t Cy_SAR2_SetAltDigitalCalibrationValue(PASS_SAR_Type * base,
                                                    const cy_stc_sar2_digital_calibration_config_t * altDigCalibConfig);
cy_en_sar2_status_t Cy_SAR2_GetAltDigitalCalibrationValue(PASS_SAR_Type * base,
                                                          cy_stc_sar2_digital_calibration_config_t * altDigCalibConfig);
cy_en_sar2_status_t Cy_SAR2_SetAnalogCalibrationValue(PASS_SAR_Type * base,
                                                           cy_stc_sar2_analog_calibration_conifg_t * analogCalibConfig);
cy_en_sar2_status_t Cy_SAR2_GetAnalogCalibrationValue(PASS_SAR_Type * base,
                                                           cy_stc_sar2_analog_calibration_conifg_t * analogCalibConfig);
cy_en_sar2_status_t Cy_SAR2_SetAltAnalogCalibrationValue(PASS_SAR_Type * base,
                                                        cy_stc_sar2_analog_calibration_conifg_t * altAnalogCalibConfig);
cy_en_sar2_status_t Cy_SAR2_GetAltAnalogCalibrationValue(PASS_SAR_Type * base,
                                                        cy_stc_sar2_analog_calibration_conifg_t * altAnalogCalibConfig);

/* For debugging */
__STATIC_INLINE cy_en_sar2_ref_buf_mode_t Cy_SAR2_GetReferenceBufferMode(PASS_EPASS_MMIO_Type * base);
__STATIC_INLINE void Cy_SAR2_SetReferenceBufferMode(PASS_EPASS_MMIO_Type * base, cy_en_sar2_ref_buf_mode_t mode);
cy_en_sar2_status_t Cy_SAR2_SetDebugFreezeMode(PASS_EPASS_MMIO_Type * base,
                                                                   const cy_stc_sar2_debug_freeze_config_t * debConfig);

/* For SAR general trigger input / output trigger setting */
cy_en_sar2_status_t Cy_SAR2_SetGenericTriggerInput(PASS_EPASS_MMIO_Type * base, uint8_t numOfAdc,
                                                               uint8_t triggerInputNumber, uint8_t genericTriggerValue);
cy_en_sar2_status_t Cy_SAR2_SetGenericTriggerOutput(PASS_EPASS_MMIO_Type * base, uint8_t numOfAdc,
                                                              uint8_t triggerOutputNumber, uint8_t genericTriggerValue);

/* For temperature measurements */
double Cy_SAR2_CalculateDieTemperature(cy_en_sar2_vdda_range_t VDDARange, uint16_t adcVtempRawValue,
                                                                                               uint16_t adcVbgRawValue);

