RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/*******************************************************************************
*                       In-line Function Implementation
*******************************************************************************/

/*******************************************************************************
* Function Name: Cy_SAR2_Enable
****************************************************************************//**
*
* Enables the SAR ADC block.
*
* \param base : The pointer to the SAR block.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Enable(PASS_SAR_Type * base)
{
    base->CTL |= PASS_SAR_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_SAR2_Disable
****************************************************************************//**
*
* Disables the SAR ADC block.
*
* \param base : The pointer to the SAR block.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Disable(PASS_SAR_Type * base)
{
    base->CTL &= ~PASS_SAR_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_SAR2_DeInit
****************************************************************************//**
*
* De-initializes the SAR ADC block, returns the register values to default.
*
* \param base : The pointer to the SAR block.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_DeInit(PASS_SAR_Type * base)
{
    base->PRECOND_CTL = 0UL;
    base->CTL = 0UL;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetPendingStatus
****************************************************************************//**
*
* Returns the trigger pending status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Pending status. Each bit corresponds a channel, i.e.
* If bit0 is 1, ch.0 is pending for a trigger.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetPendingStatus(const PASS_SAR_Type * base)
{
    return base->TR_PEND;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetWorkValidStatus
****************************************************************************//**
*
* Returns the work register valid status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Work register valid status. Each bit corresponds a channel, i.e.
* If bit0 is 1, ch.0's work register is valid.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkValidStatus(const PASS_SAR_Type * base)
{
    return base->WORK_VALID;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetWorkRangeStatus
****************************************************************************//**
*
* Returns work register range status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Work register range status. Each bit correspond a channel, i.e.
* If bit0 is 1, ch.0 detected a range.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkRangeStatus(const PASS_SAR_Type * base)
{
    return base->WORK_RANGE;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetWorkRangeHiStatus
****************************************************************************//**
*
* Returns work register range high status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Work register range Hi status. Each bit corresponds a channel, i.e.
* If bit0 is 1, ch.0 detected "out of range" and the value was above the high
* threshold.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkRangeHiStatus(const PASS_SAR_Type * base)
{
    return base->WORK_RANGE_HI;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetWorkPulseStatus
****************************************************************************//**
*
* Returns the work register pulse status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Work register pulse status. Each bit corresponds a channel, i.e.
* If bit0 is 1, ch.0 detected a pulse.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetWorkPulseStatus(const PASS_SAR_Type * base)
{
    return base->WORK_PULSE;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetResultValidStatus
****************************************************************************//**
*
* Returns result register valid status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Result register pulse status. Each bit corresponds a channel, i.e.
* If bit0 is 1, ch.0's result register is valid.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetResultValidStatus(const PASS_SAR_Type * base)
{
    return base->RESULT_VALID;
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetResultRangeHiStatus
****************************************************************************//**
*
* Returns result register range high status.
*
* \param base
* The pointer to the SAR instance.
*
* \return Result register range high. Each bit corresponds a channel, i.e.
* If bit0 is 1, ch.0 detected "out of range" and the value was above the high
* threshold.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_GetResultRangeHiStatus(const PASS_SAR_Type * base)
{
    return base->RESULT_RANGE_HI;
}

