RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/*******************************************************************************
* Function Name: Cy_SAR2_Channel_Enable
****************************************************************************//**
*
* Enables a corresponding channel.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \note To enable a group either start with enabling the last channel first
* and the first channel last, or start the trigger after all channels are
* enabled.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Channel_Enable(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    base->CH[channel].ENABLE |= PASS_SAR_CH_ENABLE_CHAN_EN_Msk;
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_Disable
****************************************************************************//**
*
* Disables a corresponding channel.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \note To disable a group either stop the trigger first or begin with disabling
* the lowest channel first.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Channel_Disable(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    base->CH[channel].ENABLE &= ~PASS_SAR_CH_ENABLE_CHAN_EN_Msk;
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_SoftwareTrigger
****************************************************************************//**
*
* Issues a software start trigger.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Channel_SoftwareTrigger(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    SAR2_CH_TR_CMD(base, channel) |= _VAL2FLD(PASS_SAR_CH_TR_CMD_START, 1UL);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Diag_Enable
****************************************************************************//**
*
* Enables the diagnostic function.
*
* \param  base: The pointer to the hardware SAR block.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Diag_Enable(PASS_SAR_Type * base)
{
    base->DIAG_CTL |= _VAL2FLD(PASS_SAR_DIAG_CTL_DIAG_EN, 1UL);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Diag_Disable
****************************************************************************//**
*
* Disables the diagnostic function.
*
* \param  base: The pointer to the hardware SAR block.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Diag_Disable(PASS_SAR_Type * base)
{
    base->DIAG_CTL &= ~PASS_SAR_DIAG_CTL_DIAG_EN_Msk;
}

/*******************************************************************************
* Function Name: Cy_SAR2_TriggerCalibrationUpdate
****************************************************************************//**
*
* Triggers calibration update. After triggering, coherently copies the values
* from alternate calibration regs to the current calibration regs.
*
* \param  base: The pointer to the hardware SAR block.
*
* \note Set an alternate calibration value before calling this function.
*       After triggering, calibration will be updated as soon as the SAR is
*       idle or a "continuous" triggered group completes.
*       To determine whether calibration update is done or not call
*       the Cy_SAR2_IsCalibrationUpdateDone function.
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_TriggerCalibrationUpdate(PASS_SAR_Type * base)
{
    base->CAL_UPD_CMD = _VAL2FLD(PASS_SAR_CAL_UPD_CMD_UPDATE, 1UL);
}

/*******************************************************************************
* Function Name: Cy_SAR2_IsCalibrationUpdateDone
****************************************************************************//**
*
* Gets the status of calibration update.
*
* \param  base: The pointer to the hardware SAR block.
*
* \return If true, calibration update is done.
*         If false, calibration update is not yet done.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SAR2_IsCalibrationUpdateDone(PASS_SAR_Type * base)
{
    return (_FLD2BOOL(PASS_SAR_CAL_UPD_CMD_UPDATE, base->CAL_UPD_CMD));
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_SetInterruptMask
****************************************************************************//**
*
* Configures the channel interrupt.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \param intrMask
* The mask of interrupts. Select one or more values from
* \ref group_sar2_macros_interrupt and "OR" them together:
* - \ref CY_SAR2_INT_GRP_DONE
* - \ref CY_SAR2_INT_GRP_CANCELLED
* - \ref CY_SAR2_INT_GRP_OVERFLOW
* - \ref CY_SAR2_INT_CH_RANGE
* - \ref CY_SAR2_INT_CH_PULSE
* - \ref CY_SAR2_INT_CH_OVERFLOW
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Channel_SetInterruptMask(PASS_SAR_Type * base, uint32_t channel, uint32_t intrMask)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    SAR2_CH_INTR_MASK(base, channel) = (intrMask & CY_SAR2_INTR);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_GetInterruptMask
****************************************************************************//**
*
* Returns interrupt mask configuration.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \return Interrupt mask value \ref group_sar2_macros_interrupt
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetInterruptMask(PASS_SAR_Type * base, uint32_t channel)
{
    return SAR2_CH_INTR_MASK(base, channel);
}

