RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_sar2.h
/*******************************************************************************
* Function Name: Cy_SAR2_Channel_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt.
* The interrupt must be cleared with this function so that the hardware
* can set subsequent interrupts and those interrupts can be forwarded
* to the interrupt controller, if enabled.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \param intrMask
* The mask of interrupts to clear. Typically this will be the value returned
* from \ref Cy_SAR_GetInterruptStatus.
* Alternately, select one or more values from \ref group_sar2_macros_interrupt
* and "OR" them together.
* - \ref CY_SAR2_INT_GRP_DONE
* - \ref CY_SAR2_INT_GRP_CANCELLED
* - \ref CY_SAR2_INT_GRP_OVERFLOW
* - \ref CY_SAR2_INT_CH_RANGE
* - \ref CY_SAR2_INT_CH_PULSE
* - \ref CY_SAR2_INT_CH_OVERFLOW
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Channel_ClearInterrupt(PASS_SAR_Type * base, uint32_t channel, uint32_t intrMask)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    SAR2_CH_INTR(base, channel) = (intrMask & CY_SAR2_INTR);
    /* Dummy read for buffered writes. */
    (void) SAR2_CH_INTR(base, channel);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_GetInterruptStatus
****************************************************************************//**
*
* Returns the channel interrupt register status.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \return status
* Contents of the channel interrupt register. See
* \ref group_sar2_macros_interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetInterruptStatus(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    return (SAR2_CH_INTR(base, channel));
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns interrupt status.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \return status
* Contents of the channel interrupt register. See
* \ref group_sar2_macros_interrupt.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetInterruptStatusMasked(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    return (SAR2_CH_INTR_MASKED(base, channel));
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_SetInterrupt
****************************************************************************//**
*
* Triggers an interrupt with software.
*
* \param base
* The pointer to the SAR instance.
*
* \param channel
* The channel number.
*
* \param intrMask
* The mask of interrupts to set.
* Select one or more values from \ref group_sar2_macros_interrupt and "OR" them
* together.
* - \ref CY_SAR2_INT_GRP_DONE
* - \ref CY_SAR2_INT_GRP_CANCELLED
* - \ref CY_SAR2_INT_GRP_OVERFLOW
* - \ref CY_SAR2_INT_CH_RANGE
* - \ref CY_SAR2_INT_CH_PULSE
* - \ref CY_SAR2_INT_CH_OVERFLOW
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_Channel_SetInterrupt(PASS_SAR_Type * base, uint32_t channel, uint32_t intrMask)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    SAR2_CH_INTR_SET(base, channel) = (intrMask & CY_SAR2_INTR);
}

/*******************************************************************************
* Function Name: Cy_SAR2_Channel_GetGroupStatus
****************************************************************************//**
*
* Returns the group conversion status.
*
* \param base
* The pointer to an SAR instance.
*
* \param channel
* The channel number.
*
* \return status
* The status of the group, conversion status bits ORed.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_SAR2_Channel_GetGroupStatus(PASS_SAR_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_SAR2_CHAN_NUM_VALID(base, channel));

    return (base->CH[channel].GRP_STAT);
}

/*******************************************************************************
* Function Name: Cy_SAR2_SetReferenceBufferMode
****************************************************************************//**
*
* Sets ePASS MMIO reference buffer mode.
*
* \param base
* The pointer to the PASS instance.
*
* \param mode
* The reference buffer mode number.
*
*******************************************************************************/
__STATIC_INLINE void Cy_SAR2_SetReferenceBufferMode(PASS_EPASS_MMIO_Type * base, cy_en_sar2_ref_buf_mode_t mode)
{
    base->PASS_CTL = _CLR_SET_FLD32U(base->PASS_CTL, PASS_EPASS_MMIO_PASS_CTL_REFBUF_MODE, mode);
}

/*******************************************************************************
* Function Name: Cy_SAR2_GetReferenceBufferMode
****************************************************************************//**
*
* Gets ePASS MMIO reference buffer mode.
*
* \param base
* The pointer to the PASS instance.
*
* \return
* \ref cy_en_sar2_ref_buf_mode_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sar2_ref_buf_mode_t Cy_SAR2_GetReferenceBufferMode(PASS_EPASS_MMIO_Type * base)
{
    return (cy_en_sar2_ref_buf_mode_t)(int32_t)(uint32_t)_FLD2VAL(PASS_EPASS_MMIO_PASS_CTL_REFBUF_MODE, base->PASS_CTL);
}


/** \} group_sar2_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_SAR2_H */

/** \} group_sar2 */
#endif /* CY_IP_MXS40EPASS_ESAR */

/* [] END OF FILE */
